# ~/lab/config/tools/Brewfile — single source of truth for installed CLI tools.
#
# Managed with `brew bundle` (Homebrew 5.x), which handles brew, cargo, go,
# uv, and npm entries from this one file.
#
#   just tools-update    install + upgrade everything listed here
#   just tools-check     verify everything here is installed
#   just tools-dump      regenerate this file from what's currently installed
#   just tools-cleanup   list (or remove) anything installed but NOT listed here
#
# OS built-ins from curr-cli.md (sed, awk, xargs, less, curl, sort/uniq/cut/
# tr/tee, strace, lsof, ss) are intentionally NOT tracked here — they ship with
# the system.

# ── Modern CLI toolkit (from notes/work/learning/curr-cli.md) ──────────────
brew "ripgrep"      # rg — content search
brew "fd"           # file finder
brew "fzf"          # fuzzy finder
brew "sd"           # find-replace (rg-compatible regex, in-place edits)
brew "ast-grep"     # structural code search/refactor (sg)
brew "jq"           # JSON query
brew "bat"          # cat with highlighting
brew "eza"          # modern ls (fzf dir previews)
brew "git-delta"    # diff pager
brew "zellij"       # terminal multiplexer
brew "tmux"         # terminal multiplexer (alt)
brew "zoxide"       # smarter cd
brew "yazi"         # file manager
brew "difftastic"   # structural diff (difft)
brew "just"         # task runner
brew "direnv"       # per-directory env
brew "watchexec"    # file watcher
brew "entr"         # file watcher (alt)
brew "parallel"     # GNU parallel
brew "socat"        # socket swiss-army knife
brew "httpie"       # friendly HTTP client
brew "xh"           # fast HTTP client
brew "hexyl"        # hex viewer
brew "miller"       # CSV/TSV/JSON wrangler (mlr)
brew "procs"        # modern ps
brew "htop"         # process viewer
brew "btop"         # process viewer (graphs)
brew "tlrc"         # tldr client
brew "typst"        # typesetting
brew "gh"           # github CLI
brew "neonctl"      # neon postgres CLI (neon/neonctl — create dbs, conn strings)

# ── Language servers / formatters (consumed by Claude Code, VSCode) ────────
brew "lua-language-server"  # lua LSP
brew "stylua"               # lua formatter

# ── Other brew tools already in use ────────────────────────────────────────
brew "bob"          # neovim version manager
brew "stow"         # dotfiles symlink manager
brew "ffmpeg"       # media transcoding
brew "webp"         # webp encode/decode

# ── Go toolchain (kept on `go install` to match the active toolchain) ──────
go "github.com/air-verse/air"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/DarthSim/overmind/v2"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"

# ── Rust project tooling (toolchain-coupled, kept on cargo) ─────────────────
cargo "sqlx-cli"

# ── uv tools ────────────────────────────────────────────────────────────────
uv "gallery-dl"

# ── npm globals ──────────────────────────────────────────────────────────────
npm "corepack"
